MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_dfs.c
/******************************************************************************
 *
 * Copyright(c) 2007 - 2022 Realtek Corporation.
 *
 * This program is free software; you can redistribute it and/or modify it
 * under the terms of version 2 of the GNU General Public License as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful, but WITHOUT
 * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or
 * FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for
 * more details.
 *
 *****************************************************************************/
#define _RTW_DFS_C_

#include <drv_types.h>

bool rtw_chset_is_dfs_range(const struct rtw_chset *chset, u32 hi, u32 lo)
{
	enum band_type band = rtw_freq2band(hi);
	u8 hi_ch = rtw_freq2ch(hi);
	u8 lo_ch = rtw_freq2ch(lo);
	int i;

	for (i = 0; i < chset->chs_len; i++){
		if (!(chset->chs[i].flags & RTW_CHF_DFS))
			continue;
		if (band == chset->chs[i].band && hi_ch > chset->chs[i].ChannelNum && lo_ch < chset->chs[i].ChannelNum)
			return 1;
	}

	return 0;
}

#if CONFIG_ALLOW_FUNC_2G_5G_ONLY
RTW_FUNC_2G_5G_ONLY bool rtw_chset_is_dfs_ch(const struct rtw_chset *chset, u8 ch)
{
	int i;

	for (i = 0; i < chset->chs_len; i++){
		if (chset->chs[i].ChannelNum == ch)
			return chset->chs[i].flags & RTW_CHF_DFS ? 1 : 0;
	}

	return 0;
}

RTW_FUNC_2G_5G_ONLY bool rtw_chset_is_dfs_chbw(const struct rtw_chset *chset, u8 ch, u8 bw, u8 offset)
{
	u32 hi, lo;

	if (!rtw_chbw_to_freq_range(ch, bw, offset, &hi, &lo))
		return 0;

	return rtw_chset_is_dfs_range(chset, hi, lo);
}
#endif

bool rtw_chset_is_dfs_bch(const struct rtw_chset *chset, enum band_type band, u8 ch)
{
	int i;

	for (i = 0; i < chset->chs_len; i++){
		if (chset->chs[i].band == band && chset->chs[i].ChannelNum == ch)
			return chset->chs[i].flags & RTW_CHF_DFS ? 1 : 0;
	}

	return 0;
}

bool rtw_chset_is_dfs_bchbw(const struct rtw_chset *chset, enum band_type band, u8 ch, u8 bw, u8 offset)
{
	u32 hi, lo;

	if (!rtw_bchbw_to_freq_range(band, ch, bw, offset, &hi, &lo))
		return 0;

	return rtw_chset_is_dfs_range(chset, hi, lo);
}

#if CONFIG_DFS && CONFIG_IEEE80211_BAND_5GHZ
static bool rtw_chset_get_dfs_frange(const struct rtw_chset *chset
	, enum band_type band, u8 ch, u8 bw, u8 offset, u32 *dfs_freq_hi, u32 *dfs_freq_lo)
{
	u32 hi, lo;
	u32 freq;
	int i;

	*dfs_freq_hi = *dfs_freq_lo = 0;

	if (!rtw_bchbw_to_freq_range(band, ch, bw, offset, &hi, &lo)) {
		rtw_warn_on(1);
		return false;
	}

	for (i = 0; i < chset->chs_len; i++){
		if (!(chset->chs[i].flags & RTW_CHF_DFS))
			continue;
		freq = rtw_bch2freq(chset->chs[i].band, chset->chs[i].ChannelNum);
		if (!freq) {
			rtw_warn_on(1);
			continue;
		}
		if (!rtw_is_range_a_in_b(freq + 10, freq - 10, hi, lo))
			continue;
		rtw_range_merge(*dfs_freq_hi, *dfs_freq_lo, freq + 10, freq - 10);
	}

	return *dfs_freq_hi != 0;
}
#endif /* CONFIG_DFS && CONFIG_IEEE80211_BAND_5GHZ */

enum rtw_dfs_regd rtw_rfctl_get_dfs_domain(struct rf_ctl_t *rfctl)
{
#ifdef CONFIG_DFS_MASTER
	return rfctl->dfs_region_domain;
#else
	return RTW_DFS_REGD_NONE;
#endif
}

bool rtw_rfctl_radar_detect_supported(struct rf_ctl_t *rfctl)
{
#ifdef CONFIG_DFS_MASTER
	enum rtw_dfs_regd domain = rtw_rfctl_get_dfs_domain(rfctl);

	return !RTW_DFS_REGD_IS_UNKNOWN(domain)
		&& rtw_dfs_hal_region_supported(rfctl_to_dvobj(rfctl), domain);
#else
	return false;
#endif
}

#ifdef CONFIG_DFS_MASTER
bool rtw_rfctl_overlap_radar_detect_ch(struct rf_ctl_t *rfctl, enum band_type band, u8 ch, u8 bw, u8 offset)
{
	bool ret = false;
	u8 rd_hwband;
	u32 hi = 0, lo = 0;
	u32 r_hi = 0, r_lo = 0;

	if (band != BAND_ON_5G || !rfctl->radar_detect_enabled)
		goto exit;

	if (rtw_bchbw_to_freq_range(band, ch, bw, offset, &hi, &lo) == _FALSE) {
		rtw_warn_on(1);
		goto exit;
	}

	rd_hwband = rfctl->radar_detect_hwband;
	if (rtw_is_range_overlap(hi, lo, rfctl->radar_detect_freq_hi[rd_hwband], rfctl->radar_detect_freq_lo[rd_hwband]))
		ret = true;

exit:
	return ret;
}

bool rtw_rfctl_hwband_is_tx_blocked_by_ch_waiting(struct rf_ctl_t *rfctl, enum phl_band_idx hwband)
{
	if (hwband >= HW_BAND_MAX)
		return false;

	if (IS_CH_WAITING(rfctl)) {
		enum band_type band;
		u8 ch, bw, offset;

		if (rtw_get_oper_bchbw_by_hwband(rfctl_to_dvobj(rfctl), hwband
				, &band, &ch, &bw, &offset) != _SUCCESS)
			return false;

		return rtw_rfctl_overlap_radar_detect_ch(rfctl
			, band, ch, bw, offset);
	}
	return false;
}

bool adapter_is_tx_blocked_by_ch_waiting(_adapter *adapter)
{
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);
	struct _ADAPTER_LINK *alink = GET_PRIMARY_LINK(adapter);

	if (!alink)
		return false;

	return rtw_rfctl_hwband_is_tx_blocked_by_ch_waiting(rfctl, ALINK_GET_HWBAND(alink));
}

bool alink_is_tx_blocked_by_ch_waiting(struct _ADAPTER_LINK *alink)
{
	_adapter *adapter = alink->adapter;
	struct rf_ctl_t *rfctl = adapter_to_rfctl(adapter);

	return rtw_rfctl_hwband_is_tx_blocked_by_ch_waiting(rfctl, ALINK_GET_HWBAND(alink));
}

/**
 * rtw_chset_update_cac_state_of_chs - update cac_done according to the given @band, @chs, @chs_len into @chset
 * @chset: the given channel set
 * @band: band of setting range
 * @chs: channel array of setting range
 * @chs_len: channel array length
 * @done: if CAC done
 */
static void rtw_chset_update_cac_state_of_chs(struct rtw_chset *chset
	, u8 chs[], u8 chs_len, bool done)
{
	int i, j;

	for (i = 0; i < chset->chs_len; i++) {
		if (chset->chs[i].band != BAND_ON_5G)
			continue;
		for (j = 0; j < chs_len; j++) {
			if (chs[j] == 0)
				continue;
			if (chset->chs[i].ChannelNum == chs[j])
				chset->chs[i].cac_done = done;
		}
	}
}

/**
 * rtw_chset_update_cac_state_by_freq - update cac_done according to the given @hi, @lo frequency into @chset
 * @chset: the given channel set
 * @hi: high frequency of setting range
 * @lo: low frequency of setting range
 * @done: if CAC done
 */
static void rtw_chset_update_cac_state_by_freq(struct rtw_chset *chset, u32 hi, u32 lo, bool done)
{
	enum band_type band;
	int i;

