MYiR-Dev/myir-imx-linux/drivers/staging/rtl8733bu/core/rtw_dfs.c
			for (i = 0; i < RD_RANGE_OPCH_NUM_MAX; i++)
				if (add_chs[i])
					break;
			if (i < RD_RANGE_OPCH_NUM_MAX)
				new_self_rd_ch = true;
		}
	}

update_ch_cac:
	if (cch && by_others) {
		/* new coverage of this hwband is detected by others, set CAC_DONE directly */
		rtw_chset_update_cac_state_by_cch(&rfctl->chset, cch, bw, true);
	}


	/* hwband CAC status update */
	if (cover_non_ocp) {
		RTW_INFO(FUNC_HWBAND_FMT" cover NON_OCP channel\n", FUNC_HWBAND_ARG(band_idx));
		if (IS_UNDER_CAC(rfctl)) {
			RTW_INFO(FUNC_HWBAND_FMT" CAC abort\n", FUNC_HWBAND_ARG(band_idx));
			rtw_os_indicate_cac_aborted(rfctl, band_idx, 0xFF
				, rfctl->radar_detect_cch[band_idx], rfctl->radar_detect_bw[band_idx]);
		}
		rtw_reset_cac(rfctl, op_ch, op_bw, op_offset);

	} else if (new_self_rd_ch) {
		/* if having new rd chs and not detected by others, reset CAC of detecting hwband */
		RTW_INFO(FUNC_HWBAND_FMT" have new detect range\n", FUNC_HWBAND_ARG(band_idx));
		rtw_reset_cac(rfctl, op_ch, op_bw, op_offset);
		rtw_os_indicate_cac_started(rfctl, band_idx, 0xFF, cch, bw);

	} else {
		u8 rd_cch;
		enum channel_width rd_bw;
		u8 i;
		bool require_cac[HW_BAND_MAX];

		if (IS_UNDER_CAC(rfctl) && cch == 0 && rfctl->radar_detect_cch[band_idx]
			&& !rfctl->radar_detect_by_others[band_idx]
		) {
			/* from detecting by self to no detecting (by self/others), CAC abort  */
			RTW_INFO(FUNC_HWBAND_FMT" disable detect, CAC abort\n", FUNC_HWBAND_ARG(band_idx));
			rtw_os_indicate_cac_aborted(rfctl, band_idx, 0xFF
				, rfctl->radar_detect_cch[band_idx], rfctl->radar_detect_bw[band_idx]);
		}

		for (i = HW_BAND_0; i < HW_BAND_MAX; i++) {
			if (i == band_idx && cch) {
				rd_cch = cch;
				rd_bw = bw;
			} else if (i != band_idx && rfctl->radar_detect_cch[i]) {
				rd_cch = rfctl->radar_detect_cch[i];
				rd_bw = rfctl->radar_detect_bw[i];
			} else {
				require_cac[i] = false;
				continue;
			}

			require_cac[i] = rtw_chset_is_cch_require_cac(&rfctl->chset, rd_cch, rd_bw);
			if (!require_cac[i]) {
				if (IS_UNDER_CAC(rfctl))
					RTW_INFO(FUNC_HWBAND_FMT" detect range already CAC done\n", FUNC_HWBAND_ARG(i));
				/* if new coverage of detecting hwband CAC_DONE, force CAC finish */
				rtw_os_force_cac_finished(rfctl, i, 0xFF, rd_cch, rd_bw);
			}
		}

		if (!IS_CAC_STOPPED(rfctl)) {
			/* set CAC stop if no hwband needed */
			for (i = HW_BAND_0; i < HW_BAND_MAX; i++)
				if (require_cac[i])
					break;
			if (i >= HW_BAND_MAX)
				rfctl->cac_start_time = rfctl->cac_end_time = RTW_CAC_STOPPED;
		}
	}
#endif /* CONFIG_DFS_MASTER */

	rfctl->radar_detect_by_others[band_idx] = by_others;
	rfctl->radar_detect_cch[band_idx] = cch;
	rfctl->radar_detect_bw[band_idx] = bw;
	rfctl->radar_detect_freq_hi[band_idx] = rd_freq_hi;
	rfctl->radar_detect_freq_lo[band_idx] = rd_freq_lo;
}

static void rtw_dfs_rd_enable(struct rf_ctl_t *rfctl, u8 band_idx, u8 op_ch, u8 op_bw, u8 op_offset
	, u32 rd_freq_hi, u32 rd_freq_lo, bool by_others)
{
#ifdef CONFIG_DFS_MASTER
	struct dvobj_priv *dvobj = rfctl_to_dvobj(rfctl);

	RTW_INFO(FUNC_HWBAND_FMT" on %u,%u,%u\n", FUNC_HWBAND_ARG(band_idx), op_ch, op_bw, op_offset);

	if (rfctl->radar_detect_enabled && rfctl->radar_detect_hwband != band_idx) {
		RTW_WARN(FUNC_HWBAND_FMT" radar_detect has been enabled for "HWBAND_FMT"\n"
			, FUNC_HWBAND_ARG(band_idx), HWBAND_ARG(rfctl->radar_detect_hwband));
		rtw_warn_on(1);
		return;
	}

	if (!rfctl->radar_detect_enabled) {
		RTW_INFO(FUNC_HWBAND_FMT" set radar_detect_enabled\n", FUNC_HWBAND_ARG(band_idx));
		rfctl->radar_detect_hwband = band_idx;
		rfctl->radar_detect_enabled = 1;
		#ifdef CONFIG_LPS
		LPS_Leave(dvobj_get_primary_adapter(dvobj), "RADAR_DETECT_EN");
		#endif
		_set_timer(&rfctl->radar_detect_timer
			, rtw_dfs_hal_radar_detect_polling_int_ms(dvobj));
	}
	rfctl->radar_detected = 0;

	rtw_dfs_update_rd_range_status(rfctl, band_idx, op_ch, op_bw, op_offset
		, rd_freq_hi, rd_freq_lo, by_others);

	rtw_dfs_hal_update_region(dvobj, band_idx, rtw_rfctl_get_dfs_domain(rfctl));
	rtw_dfs_hal_radar_detect_enable(dvobj, band_idx, IS_CH_WAITING(rfctl), rd_freq_hi, rd_freq_lo);
#else
	rtw_warn_on(1);
#endif
}

static void rtw_dfs_rd_disable(struct rf_ctl_t *rfctl, u8 band_idx, u8 op_ch, u8 op_bw, u8 op_offset
	, u32 rd_freq_hi, u32 rd_freq_lo, bool by_others)
{
#ifdef CONFIG_DFS_MASTER
	struct dvobj_priv *dvobj = rfctl_to_dvobj(rfctl);

	if (rfctl->radar_detect_hwband == band_idx) {
		if (rfctl->radar_detect_enabled) {
			RTW_INFO(FUNC_HWBAND_FMT" clear radar_detect_enabled\n", FUNC_HWBAND_ARG(band_idx));
			rfctl->radar_detect_enabled = 0;
			rfctl->radar_detected = 0;
			_cancel_timer_ex(&rfctl->radar_detect_timer);
		}

		rtw_dfs_hal_radar_detect_disable(dvobj, band_idx);
	}
#endif

	if (by_others) {
		rtw_dfs_update_rd_range_status(rfctl, band_idx, op_ch, op_bw, op_offset
			, rd_freq_hi, rd_freq_lo, true);
	} else
		rtw_dfs_update_rd_range_status(rfctl, band_idx, 0, 0, 0, 0, 0, false);
}

static bool _rtw_dfs_rd_en_decision(struct rf_ctl_t *rfctl, struct mi_state *mstate
	, enum band_type u_band, u8 u_ch, enum channel_width u_bw, enum chan_offset u_offset
	, u32 *rd_freq_hi, u32 *rd_freq_lo, bool *lgd_sta_in_dfs)
{
	bool overlap_dfs = u_ch ? rtw_chset_get_dfs_frange(&rfctl->chset, u_band, u_ch, u_bw, u_offset, rd_freq_hi, rd_freq_lo) : false;
	bool needed = false;

	if (MSTATE_STA_LG_NUM(mstate) > 0) {
		/* STA mode is linking */
		if (overlap_dfs)
			*lgd_sta_in_dfs = true;
		goto exit;
	}

	if (MSTATE_STA_LD_NUM(mstate) > 0) {
		if (overlap_dfs) {
			/*
			* if operate as slave w/o radar detect,
			* rely on AP on which STA mode connects
			*/
			if (IS_DFS_SLAVE_WITH_RD(rfctl) && rtw_rfctl_radar_detect_supported(rfctl))
				needed = true;
			*lgd_sta_in_dfs = true;
		}
		goto exit;
	}

	if (!MSTATE_AP_NUM(mstate) && !MSTATE_MESH_NUM(mstate)) {
		/* No working AP/Mesh mode */
		goto exit;
	}

	if (!overlap_dfs)
		goto exit;

	needed = true;

exit:
	return needed;
}

static void rtw_dfs_rd_en_decision(struct dvobj_priv *dvobj, enum phl_band_idx hwband
	, _adapter *adapter, struct _ADAPTER_LINK *alink, u8 mlme_act, u8 excl_ifbmp)
{
	struct rf_ctl_t *rfctl = dvobj_to_rfctl(dvobj);
	u8 band_idx;

